temp1/src/InformationRegisters/ОбработанныеУведомления/ОбработанныеУведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбработанныеУведомления</name>
  <resources>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.СобытияУведомлений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУведомления</name>
    <type>
      <types>DefinedType.ОбъектУведомления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаЗаказчиков</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

temp1/src/InformationRegisters/ОбработанныеУведомления/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Устанавливает факт обработки уведомления
Процедура ДобавитьОбработанноеУведомление(ВидСобытия, ОбъектУведомления, Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.ОбработанныеУведомления.СоздатьМенеджерЗаписи();
	Запись.ВидСобытия = ВидСобытия;
	Запись.ОбъектУведомления = ОбъектУведомления;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	
	Запись.ВидСобытия = ВидСобытия;
	Запись.ОбъектУведомления = ОбъектУведомления;
	Запись.Пользователь = Пользователь;
	Запись.ДатаОбработки = ТекущаяДата();
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
